{"class_name": "Functional", "config": {"name": "Autoencoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}], "input_layers": [["input_1", 0, 0]], "output_layers": [["input_1", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}