{"class_name": "Functional", "config": {"name": "Autoencoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "Encoder"}, "registered_name": null, "name": "Encoder", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "Decoder"}, "registered_name": null, "name": "Decoder", "inbound_nodes": []}], "input_layers": [["Encoder", 0, 0]], "output_layers": [["Decoder", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}